WIP: refactored test to use a fixture, started working on Blend Tree evaluation.
