--- a/doc/design.md
+++ b/doc/design.md
@@ -56,27 +56,14 @@ invalid.
 
 ### Example:
 
-```plantuml
-@startuml
-
-left to right direction
-
-abstract Output {}
-abstract Blend2 {
-bool is_synced
-
-float weight()
-}
-abstract AnimationA {}
-abstract TimeScale {}
-abstract AnimationB {}
-
-AnimationA --> Blend2
-AnimationB --> TimeScale
-TimeScale --> Blend2
-Blend2 --> Output
-
-@enduml
+```mermaid
+flowchart LR
+    AnimationB --> TimeScale("TimeScale
+    ----
+    *scale*")
+    AnimationA --> Blend2
+    TimeScale --> Blend2
+    Blend2 --> Output
 ```
 
 A Blend Tree always has a designated output node where the time delta is specified as an input and after the Blend Tree
